/* rexx */
'pwd'
'bright profiles create zosmf kk-zosmf --host mstrsvw.lvn.broadcom.net --port 449 --user roddi01 --pass Boston11 --reject-unauthorized false'
'bright profiles list zosmf'
exit